cf/DataProcessors/ПримерИспользованияПрогрессБараВОбработкеНаСервере.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПримерИспользованияПрогрессБараВОбработкеНаСервере</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ПрогрессБар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессБар</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/ПримерИспользованияПрогрессБараВОбработкеНаСервере/Forms/Форма/Ext/Form/Module.bsl
//данный алгоритм работоспособен только при использовании обработки в составе конфигурации (не внешней) и при условии выполнения кода в фоновом задании


&НаСервере
Процедура ОбработатьНаСервере()
	
	//Обязательная часть кода №2
	ИмяОбработки=РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	Поток.ЗапуститьПоток("Обработки."+ИмяОбработки+".Создать().ОбработатьНаСервере("""+ИмяФормы+""")",УникальныйИдентификатор);
	//
	
КонецПроцедуры


&НаКлиенте
Процедура Обработать(Команда)
	
	//Обязательная часть кода №1
	ПодключитьОбработчикОжидания("ПоказатьТекущееСостояние",1);
	//
	
	ОбработатьНаСервере();
	
КонецПроцедуры


//Обязательная часть кода №3
&НаКлиенте
Процедура ПоказатьТекущееСостояние()
	СтруктураВозврата = ПоказатьТекущееСостояниеНаСервере(ИмяФормы);
	Прогресс=СтруктураВозврата.Прогресс;
	Сост=СтруктураВозврата.Состояние;
	Состояние(Сост+". Обработано : "+Прогресс+" %",Прогресс);
	Если Прогресс>=100 Тогда
		ОтключитьОбработчикОжидания("ПоказатьТекущееСостояние");
		СброситьСчетчик(ИмяФормы);
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьТекущееСостояниеНаСервере(ИмяФормы)
	Возврат РегистрыСведений.ПрогрессБар.ПолучитьЗначение(ИмяФормы);
КонецФункции

&НаСервереБезКонтекста
Процедура СброситьСчетчик(ИмяФормы)
	 РегистрыСведений.ПрогрессБар.СброситьСчетчик(ИмяФормы);
КонецПроцедуры
//
